/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Estensione Telesec";
"06 06 02 82 06 01 0A 01"		= "Meccanismo Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autenticazione Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autenticazione password";
"06 08 02 82 06 01 0A 01 00 02" = "Autenticazione password protetta";
"06 08 02 82 06 01 0A 01 00 03" = "Autenticazione X.509 One-Way";
"06 08 02 82 06 01 0A 01 00 04" = "Autenticazione X.509 Two-Way";
"06 08 02 82 06 01 0A 01 00 05" = "Autenticazione X.509 Three-Way";
"06 08 02 82 06 01 0A 01 00 06" = "Autenticazione ISO9798 One-Way";
"06 08 02 82 06 01 0A 01 00 07" = "Autenticazione ISO9798 Two-Way";
"06 08 02 82 06 01 0A 01 00 08" = "Autenticazione Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Firma Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 con RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 con standard firma Telesec e RSA";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 con RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 con standard firma Telesec e RSA";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 con standard firma Telekom e RSA";
"06 08 02 82 06 01 0A 01 01 09"	= "Firma RSA HBCI";

"06 07 02 82 06 01 0A 01 02"	= "Criptatura Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "nessuna";
"06 08 02 82 06 01 0A 01 02 01"	= "Telesec RSA";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Funzione One-Way";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash che usa la cifratura a blocchi";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funzione FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Modulo Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmi";
"06 07 02 82 06 01 0A 02 01"	= "Tipi di attributo";
"06 07 02 82 06 01 0A 02 02"	= "Tipi di certificato";
"06 07 02 82 06 01 0A 02 03"	= "Tipi di messaggio";
"06 07 02 82 06 01 0A 02 04"	= "Protocollo PL";
"06 07 02 82 06 01 0A 02 05"	= "SME e componenti di SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definizioni utili";
"06 07 02 82 06 01 0A 02 08"	= "Documenti STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Ordine elettronico";
"06 07 02 82 06 01 0A 02 0B"	= "Applicazione asimmetrica TTP Telesec";
"06 07 02 82 06 01 0A 02 0C"	= "Applicazione base TTP Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "Messaggi TTP Telesec";
"06 07 02 82 06 01 0A 02 0E"	= "Applicazione Time Stamp TTP Telesec";

"06 06 02 82 06 01 0A 03"		= "Classe oggetto";
"06 07 02 82 06 01 0A 03 00"	= "Altro nome Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Directory";
"06 07 02 82 06 01 0A 03 02"	= "Tipo directory";
"06 07 02 82 06 01 0A 03 03"	= "Gruppo directory";
"06 07 02 82 06 01 0A 03 04"	= "Utente directory";
"06 07 02 82 06 01 0A 03 05"	= "Voce chiave simmetrica";

"06 06 02 82 06 01 0A 04"		= "Pacchetto";
"06 06 02 82 06 01 0A 05"		= "Parametro";
"06 06 02 82 06 01 0A 06"		= "Assegnazione nome";
"06 06 02 82 06 01 0A 07"		= "Attributo";
"06 07 02 82 06 01 0A 07 00"	= "Identificatore gruppo applicazione";
"06 07 02 82 06 01 0A 07 01"	= "Tipo di certificato";
"06 07 02 82 06 01 0A 07 02"	= "Certificato Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Numero di certificato";
"06 07 02 82 06 01 0A 07 04"	= "Elenco dei certificati revocati";
"06 07 02 82 06 01 0A 07 05"	= "Data di creazione";
"06 07 02 82 06 01 0A 07 06"	= "Emesso da";
"06 07 02 82 06 01 0A 07 07"	= "Autorità di denominazione";
"06 07 02 82 06 01 0A 07 08"	= "Directory chiave pubblica";
"06 07 02 82 06 01 0A 07 09"	= "Dominio sicurezza";
"06 07 02 82 06 01 0A 07 0A"	= "Oggetto";
"06 07 02 82 06 01 0A 07 0B"	= "Ora di revoca";
"06 07 02 82 06 01 0A 07 0C"	= "Riferimento gruppo utente";
"06 07 02 82 06 01 0A 07 0D"	= "Validità";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Ambiente di sicurezza messaggio";
"06 07 02 82 06 01 0A 07 10"	= "Directory chiave pubblica anonima";
"06 07 02 82 06 01 0A 07 11"	= "Nome Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Aggiunte nome";
"06 07 02 82 06 01 0A 07 13"	= "Codice postale Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Elemento di distinzione del nome";
"06 07 02 82 06 01 0A 07 15"	= "Elenco dei certificati Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Elenco dei certificati Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Elenco dei certificati X.509";
"06 07 02 82 06 01 0A 07 18"	= "Ora di emissione";
"06 07 02 82 06 01 0A 07 19"	= "Numero scheda fisico";
"06 07 02 82 06 01 0A 07 1A"	= "Tipo documento";
"06 07 02 82 06 01 0A 07 1B"	= "il documento Ctl è un archivio";
"06 07 02 82 06 01 0A 07 1C"	= "Indirizzo e-mail";
"06 07 02 82 06 01 0A 07 1D"	= "Elenco dei modelli di certificato";
"06 07 02 82 06 01 0A 07 1E"	= "Nome directory";
"06 07 02 82 06 01 0A 07 1F"	= "Nome tipo di directory";
"06 07 02 82 06 01 0A 07 20"	= "Nome gruppo di directory";
"06 07 02 82 06 01 0A 07 21"	= "Nome utente directory";
"06 07 02 82 06 01 0A 07 22"	= "Contrassegno revoca";
"06 07 02 82 06 01 0A 07 23"	= "Nome voce chiave simmetrica";
"06 07 02 82 06 01 0A 07 24"	= "Numero GL";
"06 07 02 82 06 01 0A 07 25"	= "Numero GO";
"06 07 02 82 06 01 0A 07 26"	= "Dati chiave G";
"06 07 02 82 06 01 0A 07 27"	= "Dati chiave Z";
"06 07 02 82 06 01 0A 07 28"	= "Dati chiave KT";
"06 07 02 82 06 01 0A 07 2A"	= "Numero chiave KT";
"06 07 02 82 06 01 0A 07 33"	= "Ora di generazione della revoca";
"06 07 02 82 06 01 0A 07 34"	= "Testo delle responsabilità";

"06 06 02 82 06 01 0A 08"		= "Gruppo attributi";
"06 06 02 82 06 01 0A 09"		= "Azione";
"06 06 02 82 06 01 0A 0A"		= "Notifica";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Applicazione sicurezza";

"06 06 02 82 06 01 0A 0C"		= "Definizioni estensione CRL e Cert";

"06 07 02 82 06 01 0A 0C 00"	= "Estensione delle limitazioni di responsabilità estensioni certificato";
"06 07 02 82 06 01 0A 0C 01"	= "Estensione ID certificato Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identificatore policy Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID qualificatore policy Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Estensione filtrata CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Estensione filtro CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Estensione autorità di denominazione Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID utente";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Casella RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Componente dominio";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "ABN (Australian Business Number)";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificati Australia identificatore policy";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Sigillo personale";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Sigillo impresa";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Sigillo legale";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Sigillo pilota";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Sigillo IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Sigillo identificatore della policy";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritmo di criptatura simmetrico";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identificatore policy di sicurezza elevata SEIS";
"06 06 2A 85 70 22 01 02"	= "Identificatore policy GAK SEIS";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Identificatore personale AT SEIS";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Modulo ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Gestione certificato X9F1";
"06 06 2A 86 48 CE 38 02"		= "Istruzioni Hold";
"06 07 2A 86 48 CE 38 02 01"	= "Nessuna istruzione Hold";
"06 07 2A 86 48 CE 38 02 02"	= "Emittente chiamata";
"06 07 2A 86 48 CE 38 02 03"	= "Rifiuta";
"06 07 2A 86 48 CE 38 02 04"	= "Token di prelievo";
"06 06 2A 86 48 CE 38 03"		= "Attributo";
"06 06 2A 86 48 CE 38 03 01"	= "Controfirma";
"06 06 2A 86 48 CE 38 03 02"	= "Certificato attributo";
"06 06 2A 86 48 CE 38 04"		= "Algoritmo";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Corrispondenza DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA con SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tipo campo ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Campo principale";
"06 07 2A 86 48 CE 3D 01 02"	= "Campo Characteristic-Two";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Base Characteristic-Two";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base nulla";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base trinomiale";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base pentanomiale";
"06 06 2A 86 48 CE 3D 02"		= "Tipo chiave pubblica";
"06 07 2A 86 48 CE 3D 02 01"	= "Chiave pubblica curva ellittica";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tipo campo ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Primo campo Galois";
"06 06 2A 86 48 CE 3E 02"		= "Tipo numero";
"06 07 2A 86 48 CE 3E 02 01"	= "Chiave pubblica Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Schema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman statico";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman ibrido 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman ibrido 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Informazioni versione Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE con MD5 e CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC con password";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Utente Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Informazioni CA Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificato attributo";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Criptatura RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Criptatura RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Etichetta RSA-OAEP specificata";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Schema firma RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 con criptatura RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 con criptatura RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Criptatura RSA BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Accordo di base Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE con MD2 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE con MD5 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE con MD2 e RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE con MD5 e RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE con MD5 e XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE con SHA e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dati";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Dati firmati";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dati in busta digitale";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Dati firmati e in busta digitale";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Compendio di dati";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dati criptati";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dati con attributi";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informazioni criptata sulla chiave privata";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Indirizzo e-mail";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nome non strutturato";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tipo di contenuto";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Impronta del messaggio";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Ora firma";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Controfirma";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Verifica la password";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Indirizzo non strutturato";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Attributi certificato estesi";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emittente e numero di serie";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Verifica della password";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Chiave pubblica";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descrizione firma";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Richiesta estensione";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Capacità S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferisci la data firmata";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Impossibile decriptare";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Richiesta registro";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Registro";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Suggerimenti contenuto";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Cronologia espansione elenco posta elettronica";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Moduli S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintassi del messaggio crittografico";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Servizi di sicurezza avanzata";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identificatore oggetto S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Messaggio V3 S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Firma elettronica 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Firma elettronica 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Policy firma elettronica 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Policy firma elettronica 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Tipi di contenuto S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Attributi autenticati S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmi S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribuzione certificati S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribuzione certificato LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Qualificatore policy firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identificatore del tipo di firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Firma creatore";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Firma dominio";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Firma attributi aggiuntivi";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Verifica firma";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Capacità S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferisci binario interno";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nome breve (per PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID chiave locale (per PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipi di certificato (per PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificato X.509 (per PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificato SDSI (per PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipi CRL (per PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (per PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintassi dello scambio di informazioni personali PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID PKCS-12 di criptatura con password";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE con SHA-1 e 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE con SHA-1 e 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE con SHA-1 e 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE con SHA-1 e 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE con SHA-1 e 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE con SHA-1 e 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "ID PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Copertura chiave PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID PKCS-12 Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID Bag chiave PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID Bag CRL e Certificato PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID Bag segreto PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID contenuto sicuro PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID Bag chiave coperta PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID Bag certificato PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID Bag CRL e Certificato X.509 PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID Bag Certificato SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID criptatura con password PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE con SHA-1 e 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE con SHA-1 e 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE con SHA-1 e Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE con SHA-1 e 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE con SHA-1 e 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE con SHA-1 e RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE con SHA-1 e RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID busta digitale PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Criptatura RSA PKCS-12 RSA con 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Criptatura RSA PKCS-12 con 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Criptatura RSA PKCS-12 con Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID Firma PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Criptatura RSA PKCS-12 con SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Versione 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID PKCS-12 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Bag chiave PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Bag chiave coperta PKCS-8 PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Bag certificato PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Bag CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Bag segreto PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag contenuto segreto PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Moduli PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Attributi PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Tipo contenuto PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Contenuto PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritmo Digest RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC con SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritmo di criptatura RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 con MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificatore policy Identrus sconosciuto";
"06 08 2A 86 48 86 FA 65 04 01"			= "OCSP Identrus";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Kerberos Utente-Utente MIT";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Kerberos Microsoft";

"06 08 2A 86 48 86 F7 14 01 03"				= "Classe oggetto Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Indirizzamento sito";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Schema Class";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Schema attributo";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agente casella postale";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Casella di posta";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Contenitore";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatario posta elettronica";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Meccanismo di consegna";

"06 07 2A 86 48 86 F7 14 04"				= "Formati documenti Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Contesto dati indiretti SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Informazioni agenzia SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Tipo di istruzione SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Informazioni Opus SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Estensioni certificato SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Dati immagine PE SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Link SPC (tipo 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Firma codice individuale";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Firma codice commerciale";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Link SPC (tipo 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Criteri minimi SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Criteri finanziari SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Link SPC (tipo 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Provider del supporto di sicurezza NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Controfirma Time Stamp";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Elenco dei certificati attendibili";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Estensione CTL ordinata";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Posizione prossimo aggiornamento";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Utilizzo chiavi avanzato";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Firma elenco dei certificati attendibili";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Firma Time Stamp";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Criptatura per porte Server";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Criptatura serializzata";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistemi documenti criptati";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recupero file system crittografati";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatibile con hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Firma NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Firma OEM dell’hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Firma NT incorporate";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Firma elenco dei root attendibili";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinazione qualificata";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recupero della chiave";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Firma documento";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identificatori oggetti attributo";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Attributo di fiducia Sì/No";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "DRM musica Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualizzazione DRM Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licenze Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Server licenze Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identificatori oggetti PKCS-10 Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificato di rinnovo";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Coppia Nome/Valore di iscrizione";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP Iscrizione";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versione sistema operativo";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Attributi PKCS-12 Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Keyset macchina locale";

"06 08 2B 06 01 04 01 82 37 14"				= "Infrastruttura iscrizione Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Uso dell’autoregistrazione CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tipo di certificato di autoregistrazione";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agente di Iscrizione";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Accesso Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nome principale NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infrastruttura dei server di certificati Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versione di rinnovo CA di Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versione CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Attributo CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nome documento";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descrizione documento";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dati criptati";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Contenuto criptato";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identificatore della policy UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identificatore policy ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identificatore della policy CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal con SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal con RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Attributi cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Verifica presenza cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS di risposta OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "RTCS di risposta OCSP esteso";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Motivazione estesa CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Funzionalità chiave";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Boot PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Contenuto cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dati di configurazione cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Indice utente cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informazioni utente cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identificatore policy XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistema di convalida temporale";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistema di convalida temporale 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistema di convalida temporale 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistema di convalida temporale 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Procedure secondarie";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificatori medici";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "PKINIT Kerberos";
"06 07 2B 06 01 05 02 03 01"        = "Dati autenticazione Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dati chiave Diffie-Hellman Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Dati chiave risposta Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Autenticazione client Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centro di distribuzione chiave Kerberos (KDC, Key Distribution Center)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastruttura chiave pubblica";

"06 07 2B 06 01 05 05 07 01"		= "Estensioni certificato privato PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Accesso informazioni sull’autorità del certificato";
"06 08 2B 06 01 05 05 07 01 02"		= "Informazioni biometriche";
"06 08 2B 06 01 05 05 07 01 03"		= "Dichiarazioni qualificate del certificato";
"06 08 2B 06 01 05 05 07 01 04"		= "Identità per la responsabilità del certificato di attributo";
"06 08 2B 06 01 05 05 07 01 05"		= "Assegnazione di target al certificato di attributo";
"06 08 2B 06 01 05 05 07 01 06"		= "Controlli autorità del certificato di attributo";
"06 08 2B 06 01 05 05 07 01 07"		= "Blocco indirizzi IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Identificatore sistema autonomo SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identificatore router SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Creazione di un proxy del certificato di attributo";
"06 08 2B 06 01 05 05 07 01 0B"		= "Accesso alle informazioni del soggetto";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotipo";

"06 07 2B 06 01 05 05 07 02"		= "Tipi qualificatore delle policy";
"06 08 2B 06 01 05 05 07 02 01"		= "CPS (Certification Practice Statement)";
"06 08 2B 06 01 05 05 07 02 02"		= "Avviso utente";
"06 08 2B 06 01 05 05 07 02 03"		= "Avviso testo";

"06 07 2B 06 01 05 05 07 03"		= "Scopo chiave";
"06 08 2B 06 01 05 05 07 03 01"		= "Autenticazione server";
"06 08 2B 06 01 05 05 07 03 02"		= "Autenticazione client";
"06 08 2B 06 01 05 05 07 03 03"		= "Firma codice";
"06 08 2B 06 01 05 05 07 03 04"		= "Protezione E-mail";
"06 08 2B 06 01 05 05 07 03 05"		= "Sistema terminale IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Tunnel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Utente IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Time Stamping";
"06 08 2B 06 01 05 05 07 03 09"		= "Firma OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autenticazione server AA SBGP";

"06 07 2B 06 01 05 05 07 04"		= "Tipi di informazione CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificato criptatura protocollo CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Tipi di firma delle coppie di chiave";
"06 08 2B 06 01 05 05 07 04 03"		= "Tipi di criptatura delle coppie di chiave";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritmo simmetrico preferito";
"06 08 2B 06 01 05 05 07 04 05"		= "Informazioni aggiornamento chiave CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL attuale";
"06 08 2B 06 01 05 05 07 04 07"		= "OID non supportati";
"06 08 2B 06 01 05 05 07 04 08"		= "Richiesta di sottoscrizione";
"06 08 2B 06 01 05 05 07 04 09"		= "Risposta di sottoscrizione";
"06 08 2B 06 01 05 05 07 04 0A"		= "Richiesta dei parametri delle coppie delle chiavi";
"06 08 2B 06 01 05 05 07 04 0B"		= "Risposta dei parametri delle coppie delle chiavi";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registrazione CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Controllo della registrazione";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Token di registrazione";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autenticatore";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Informazioni pubblicazione PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opzioni archivio PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID certificato precedente";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Chiave di criptatura del protocollo";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alterna il modello del certificato";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Modello WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Informazioni della registrazione CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Coppie UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Richiesta del certificato";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmi";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Nessuna firma";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controlli CMC";

"06 07 2B 06 01 05 05 07 08"		= "Altri nomi";
"06 08 2B 06 01 05 05 07 08 01"		= "Dati personali";
"06 08 2B 06 01 05 05 07 08 02"		= "Gruppo utente";

"06 07 2B 06 01 05 05 07 09"		= "Dati personali";
"06 08 2B 06 01 05 05 07 09 01"		= "Data di nascita";
"06 08 2B 06 01 05 05 07 09 02"		= "Luogo di nascita";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonimo";
"06 08 2B 06 01 05 05 07 09 04"		= "Sesso";
"06 08 2B 06 01 05 05 07 09 05"		= "Paese di cittadinanza";
"06 08 2B 06 01 05 05 07 09 06"		= "Paese di residenza";

"06 07 2B 06 01 05 05 07 0A"		= "Certificato attributo";
"06 08 2B 06 01 05 05 07 0A 01"		= "Informazioni di autenticazione";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identità d’accesso";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identità per l’addebito";
"06 08 2B 06 01 05 05 07 0A 04"		= "Gruppo";
"06 08 2B 06 01 05 05 07 0A 05"		= "Ruolo";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "OCSP (Online Certificate Status Protocol)";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Risposta di base OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Estensione Nonce OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Riferimento CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Risposta OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Nessuna verifica OCSP della revoca";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Limite archivio OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Localizzatore servizio OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emittenti CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Time Stamping";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE intermedio";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritmo di criptatura DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritmo Hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmo firma DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 con RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 con RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 con RSA";
"06 05 2B 0E 03 02 03"				= "MD5 con RSA";
"06 05 2B 0E 03 02 04"				= "MD4 con criptatura RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N con RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Firma RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA con SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 con firma RSA";
"06 05 2B 0E 03 02 0F"				= "SHA con firma RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman con modulo comune";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA comune";
"06 05 2B 0E 03 02 15"				= "DSA comune con SHA";
"06 05 2B 0E 03 02 16"				= "Trasporto chiave RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 con firma RSA";
"06 05 2B 0E 03 02 19"				= "MD5 con firma RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA con SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA con SHA-1 comune";
"06 05 2B 0E 03 02 1D"				= "SHA-1 con criptatura RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 con RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 con ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Documento";
"06 04 2B 24 01 01"					= "Versione finale";
"06 04 2B 24 01 02"					= "Bozza";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmo";
"06 04 2B 24 03 01"					= "Algoritmo di criptatura";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Criptatura RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Algoritmo Hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Singola lunghezza MDC2";
"06 05 2B 24 03 02 05"				= "Doppia lunghezza MDC2";
"06 04 2B 24 03 03"					= "Algoritmo della firma";
"06 05 2B 24 03 03 01"				= "Firma RSA";

"06 06 2B 24 03 03 01 01"			= "Firma RSA con SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Firma RSA con SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Firma RSA con SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Firma RSA con SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Firma RSA con SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Firma RSA con SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Firma RSA con SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Firma RSA con SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Firma RSA con SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Firma RSA con SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Firma RSA con SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Firma RSA con SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Firma RSA con SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Firma RSA con SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Firma RSA con SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Firma RSA con SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Firma RSA con SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Firma RSA con SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Firma RSA con SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Firma RSA con SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Firma RSA con SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Firma RSA con SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Firma RSA con SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Firma RSA con SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Firma RSA con SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Firma RSA con SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Firma RSA con RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Firma RSA con RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Firma RSA con RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Firma RSA con RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Firma RSA con RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Firma RSA con RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Firma RSA con RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Firma RSA con RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Firma RSA con RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Firma RSA con RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Firma RSA con RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Firma RSA con RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Firma RSA con RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Firma RSA con RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Firma RSA con RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Firma RSA con RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Firma RSA con RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Firma RSA con RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Firma RSA con RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Firma RSA con RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Firma RSA con RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Firma RSA con RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Firma RSA con RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Firma RSA con RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Firma RSA con RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Firma RSA con RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Firma RSA con RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Firma RSA con RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Firma ECSIE";
"06 06 2B 24 03 03 02 01"			= "Firma ECSIE con SHA-1";
"06 06 2B 24 03 03 02 02"			= "Firma ECSIE con RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Firma ECSIE con MD2";
"06 06 2B 24 03 03 02 04"			= "Firma ECSIE con MD5";

"06 04 2B 24 03 04"					= "Schema firma";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 con RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 con RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 con RND";

"06 03 2B 24 04"					= "Attributo";
"06 03 2B 24 05"					= "Policy";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API specifico di un produttore";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API con funzionalità specifica";
"06 03 2B 24 07"					= "Gestione chiave";
"06 04 2B 24 07 01"					= "Disposizione chiave";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Trasferimento chiave";
"06 05 2B 24 07 02 01"				= "ISO9796-2 con criptatura RSA";

"06 05 2B 24 08 01 01"				= "Identificatore policy SigiSigConform Teletrust";
"06 05 2B 24 08 02 01"				= "Servizio directory";

"06 05 2B 24 08 03 01"				= "Data della creazione del certificato";
"06 05 2B 24 08 03 02"				= "Procura";
"06 05 2B 24 08 03 03"				= "Ammissione";
"06 05 2B 24 08 03 04"				= "Limite monetario";
"06 05 2B 24 08 03 05"				= "Dichiarazione di maggioranza";
"06 05 2B 24 08 03 06"				= "Numero di serie carta circuito integrato";
"06 05 2B 24 08 03 07"				= "Riferimento chiave pubblica";
"06 05 2B 24 08 03 08"				= "Restrizione";
"06 05 2B 24 08 03 09"				= "Recupera se permesso";
"06 05 2B 24 08 03 0A"				= "Certificato richiesto";
"06 05 2B 24 08 03 0B"				= "Autorità di denominazione";
"06 05 2B 24 08 03 0C"				= "Certificato in directory da";
"06 05 2B 24 08 03 0D"				= "Hash del certificato";

"06 05 2B 24 08 04 01"				= "Dati personali";
"06 05 2B 24 08 04 08"				= "Restrizione";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA con SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA con RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA esteso";
"06 07 2B 24 08 05 01 02 02"		= "DSA con RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificato";
"06 05 2B 24 08 06 02"				= "Riferimento certificato";
"06 05 2B 24 08 06 03"				= "Certificato attributo";
"06 05 2B 24 08 06 04"				= "Riferimento attributo";
"06 05 2B 24 08 06 05"				= "Nome documento";
"06 05 2B 24 08 06 06"				= "Tempo di memorizzazione";
"06 05 2B 24 08 06 07"				= "Dimensione documento";
"06 05 2B 24 08 06 08"				= "Posizione";
"06 05 2B 24 08 06 09"				= "Numero firma";
"06 05 2B 24 08 06 0A"				= "Autogenerato";

"06 05 2B 24 08 07 01"				= "Tipi di presentazione Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiProAmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binario";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Messaggi";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Estensione certificato Thawte";
"06 05 2B 65 01 04 01"				= "Extranet forte";

/* X.520 */

"06 02 55 04"		= "Tipi di attributo X.520";
"06 03 55 04 00"	= "Classe oggetto";
"06 03 55 04 01"	= "Nome voce con alias";
"06 03 55 04 02"	= "Informazioni di conoscenza";
"06 03 55 04 03"	= "Nome comune";
"06 03 55 04 04"	= "Cognome";
"06 03 55 04 05"	= "Numero di serie";
"06 03 55 04 06"	= "Nome Paese";
"06 03 55 04 07"	= "Nome località";
"06 04 55 04 07 01"	= "Nome località collettivo";
"06 03 55 04 08"	= "Nome stato o provincia";
"06 04 55 04 08 01"	= "Nome collettivo di stato o provincia";
"06 03 55 04 09"	= "Indirizzo";
"06 04 55 04 09 01"	= "Indirizzo collettivo";
"06 03 55 04 0A"	= "Nome organizzazione";
"06 04 55 04 0A 01"	= "Nome collettivo organizzazione";
"06 03 55 04 0B"	= "Nome unità organizzativa";
"06 04 55 04 0B 01"	= "Nome collettivo unità organizzativa";
"06 03 55 04 0C"	= "Titolo";
"06 03 55 04 0D"	= "Descrizione";
"06 03 55 04 0E"	= "Guida di ricerca";
"06 03 55 04 0F"	= "Categoria azienda";
"06 03 55 04 10"	= "Indirizzo postale";
"06 04 55 04 10 01"	= "Indirizzo postale collettivo";
"06 03 55 04 11"	= "Codice postale";
"06 04 55 04 11 01"	= "Codice postale collettivo";
"06 03 55 04 12"	= "Casella postale";
"06 04 55 04 12 01"	= "Casella postale collettiva";
"06 03 55 04 13"	= "Nome fisico dell’ufficio per la consegna";
"06 04 55 04 13 01"	= "Nome fisico collettivo dell’ufficio per la consegna";
"06 03 55 04 14"	= "Numero di telefono";
"06 04 55 04 14 01"	= "Numero di telefono collettivo";
"06 03 55 04 15"	= "Numero Telex";
"06 04 55 04 15 01"	= "Numero telex collettivo";
"06 03 55 04 16"	= "Identificatore terminale teletex";
"06 04 55 04 16 01"	= "Identificatore terminale teletex collettivo";
"06 03 55 04 17"	= "Numero di telefono facsimile";
"06 04 55 04 17 01"	= "Numero di telefono facsimile collettivo";
"06 03 55 04 18"	= "Indirizzo X.121";
"06 03 55 04 19"	= "Numero ISDN internazionale";
"06 04 55 04 19 01"	= "Numero ISDN internazionale collettivo";
"06 03 55 04 1A"	= "Indirizzo registrato";
"06 03 55 04 1B"	= "Indicatore di destinazione";
"06 03 55 04 1C"	= "Metodo di consegna preferito";
"06 03 55 04 1D"	= "Indirizzo di presentazione";
"06 03 55 04 1E"	= "Contesto applicativo supportato";
"06 03 55 04 1F"	= "Utente";
"06 03 55 04 20"	= "Proprietario";
"06 03 55 04 21"	= "Assegnatario di ruolo";
"06 03 55 04 22"	= "Vedi anche";
"06 03 55 04 23"	= "Password utente";
"06 03 55 04 24"	= "Certificato utente";
"06 03 55 04 25"	= "Certificato CA";
"06 03 55 04 26"	= "Elenco delle autorità revocate";
"06 03 55 04 27"	= "Elenco dei certificati revocati";
"06 03 55 04 28"	= "Abbinamento di certificati incrociati";
"06 03 55 04 29"	= "Nome";
"06 03 55 04 2A"	= "Nome";
"06 03 55 04 2B"	= "Iniziali";
"06 03 55 04 2C"	= "Qualificatore di generazione";
"06 03 55 04 2D"	= "Identificatore unico";
"06 03 55 04 2E"	= "Qualificatore DN";
"06 03 55 04 2F"	= "Guida di ricerca avanzata";
"06 03 55 04 30"	= "Informazioni di protocollo";
"06 03 55 04 31"	= "Nome distintivo";
"06 03 55 04 32"	= "Utente unico";
"06 03 55 04 33"	= "Identificatore casa";
"06 03 55 04 34"	= "Algoritmi supportati";
"06 03 55 04 35"	= "Elenco delta revocati";
"06 03 55 04 36"	= "Autorizzazione";
"06 03 55 04 3A"	= "Abbinamento di certificati incrociati";

/* X.500 object classes */

"06 02 55 06"		= "Classe oggetto X.520";
"06 03 55 06 00"	= "In alto";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Paese";
"06 03 55 06 03"	= "Località";
"06 03 55 06 04"	= "Organizzazione";
"06 03 55 06 05"	= "Unità organizzativa";
"06 03 55 06 06"	= "Persona";
"06 03 55 06 07"	= "Persona organizzativa";
"06 03 55 06 08"	= "Ruolo organizzativo";
"06 03 55 06 09"	= "Gruppo di nomi";
"06 03 55 06 0A"	= "Persona residenziale";
"06 03 55 06 0B"	= "Processo applicativo";
"06 03 55 06 0C"	= "Entità applicativa";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispositivo";
"06 03 55 06 0F"	= "Utente autenticazione forte";
"06 03 55 06 10"	= "Autorità certificato";
"06 03 55 06 11"	= "Gruppo di nomi unici";
"06 03 55 06 15"	= "Utente PKI";
"06 03 55 06 16"	= "CA PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmi X.500";
"06 03 55 08 01"	= "Algoritmi criptatura X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Estensioni certificato X.509";
"06 03 55 1D 01"	= "Identificatore chiave autorità (preced.)";
"06 03 55 1D 02"	= "Attributi chiave primaria (preced.)";
"06 03 55 1D 03"	= "Regole certificato (preced.)";
"06 03 55 1D 04"	= "Limiti utilizzo chiave (preced.)";
"06 03 55 1D 05"	= "Mapping delle policy (preced.)";
"06 03 55 1D 06"	= "Limite sottoalberi";
"06 03 55 1D 07"	= "Nome alternativo soggetto (preced.)";
"06 03 55 1D 08"	= "Nome alternativo emittente (preced.)";
"06 03 55 1D 09"	= "Attributi directory soggetto";
"06 03 55 1D 0A"	= "Limiti di base (preced. 2.5.29.10)";
"06 03 55 1D 0B"	= "Limiti nome (preced.)";
"06 03 55 1D 0C"	= "Limiti policy (preced.)";
"06 03 55 1D 0D"	= "Limiti di base (preced. 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificatore chiave soggetto";
"06 03 55 1D 0F"	= "Utilizzo chiave";
"06 03 55 1D 10"	= "Periodo utilizzo chiave privato";
"06 03 55 1D 11"	= "Nome alternativo soggetto";
"06 03 55 1D 12"	= "Nome alternativo emittente";
"06 03 55 1D 13"	= "Limiti di base";
"06 03 55 1D 14"	= "Numero elenco dei certificati revocati";
"06 03 55 1D 15"	= "Codice di motivazione CRL";
"06 03 55 1D 16"	= "Data di scadenza (preced.)";
"06 03 55 1D 17"	= "Codice istruzioni Hold";
"06 03 55 1D 18"	= "Data nullità";
"06 03 55 1D 19"	= "Punti di distribuzione CRL (preced.)";
"06 03 55 1D 1A"	= "Punti di distribuzione di emissione (preced.)";
"06 03 55 1D 1B"	= "Indicatore CRL delta";
"06 03 55 1D 1C"	= "Punti di distribuzione di emissione";
"06 03 55 1D 1D"	= "Emittente certificato";
"06 03 55 1D 1E"	= "Limiti nome";
"06 03 55 1D 1F"	= "Punti di distribuzione CRL";
"06 03 55 1D 20"	= "Regole certificato";
"06 04 55 1D 20 00"	= "Qualsiasi identificatore policy";
"06 03 55 1D 21"	= "Mapping delle policy";
"06 03 55 1D 22"	= "Limiti policy";
"06 03 55 1D 23"	= "Identificatore chiave autorità";
"06 03 55 1D 24"	= "Limiti policy";
"06 03 55 1D 25"	= "Uso chiave esteso";
"06 04 55 1D 25 00"	= "Qualsiasi utilizzo chiave estesa";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritmo firma SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritmo firma Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritmo confidenzialità SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritmo confidenzialità Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritmo integrità SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritmo integrità Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritmo protezione token SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritmo protezione token Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritmo gestione chiave SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritmo gestione chiave Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritmo firma e gestione chiave SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritmo firma e gestione chiave Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritmo firma Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritmo confidenzialità Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritmo integrità Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritmo protezione token Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritmo gestione chiave Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritmo firma e gestione chiave Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritmo firma aggiornata Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmi firma aggiornata e gestione chiave Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritmo integrità aggiornata Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmo per lo scambio delle chiavi";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritmo Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "KEA (Key Encryption Algorithm)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Formato messaggio RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Senza contenuto";
"06 09 60 86 48 01 65 02 01 02 03"	= "Tipo contenuto CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Tipo contenuto MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Tipo contenuto MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocollo agente reimpostazione chiavi MSPl";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Tipo contenuto MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Parte del corpo del messaggio MSP inoltrato";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametri del messaggio inoltrato MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Parte del corpo del messaggio CSP inoltrato";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametri del messaggio inoltrato CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Policy di sicurezza SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Policy di sicurezza";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Generico";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Policy di sicurezza di default";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificato di gestione chiave SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificato di firma dell’utente SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certificato di firma e gestione della chiave SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificato di gestione della chiave Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificato di firma e gestione della chiave Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificato di firma dell’utente Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificato di firma CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificato di firma CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vettore ausiliare";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Policy di ricezione";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Appartenenza";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Amministratori";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL firma Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL firma SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Elenco dei certificati revocati SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Elenco dei certificati revocati Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processore indirizzi esenti";
"06 09 60 86 48 01 65 02 01 05 30"	= "Protezione";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmi supportati";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificato di gestione delle chiavi Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certificato di firma e gestione delle chiavi Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificato di firma dell’utente Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Informazioni PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Limitazioni CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilegi di firma o gestione delle chiavi";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilegi Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "Attributo con etichetta";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Documento di informazione della policy";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Documento di informazione della policy di sicurezza";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Limitazione autorizzazioni CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Estensioni CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Categorie di sicurezza ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilegi standard dell’etichetta di sicurezza";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilegi di firma";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilegi di gestione delle chiavi";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilegio del gruppo di etichette con nome";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Dipartimento di Difesa degli Stati Uniti Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "Pilota medio USA";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Dipartimento di Difesa degli Stati Uniti Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Dipartimento di Difesa degli Stati Uniti Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Dipartimento di Difesa degli Stati Uniti Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Dipartimento di Difesa degli Stati Uniti PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Policy di sicurezza della verifica";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Tag Set Two";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Categorie di sicurezza TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Tag Set Two";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Categorie di sicurezza Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka Tag Set Name 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka Tag Set Name 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka Tag Set Name 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Voce CRL di verifica";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etichetta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identificatore policy GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificatore policy rudimentale FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificatore policy di base FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificatore policy medio FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificatore policy alto FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Chiave KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Estensioni";
"06 09 60 86 48 01 65 03 02 03 01"		= "Tecnica di recupero della chiave";
"06 09 60 86 48 01 65 03 02 03 02"		= "Capace di recuperare la chiave";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recupero della chiave";
"06 08 60 86 48 01 65 03 02 04"			= "Schemi di recupero delle chiavi";
"06 08 60 86 48 01 65 03 02 05"			= "Estensione GAK CSOR";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritmo NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritmo Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 con criptatura RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 con criptatura RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 con criptatura RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Digest LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC con SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC con MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Pacchetto MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Criptatura RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Password NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Tipo di attributo PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Attributi di sicurezza";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limite di fiducia";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identificatore oggetto Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Estensione certificato Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Tipo di certificato Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL di base Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL di revoca Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL di revoca CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL di download CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL di download dei certificati CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL di rinnovo dei certificati Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL della policy CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL della homepage dei certificati Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo dell’entità dei certificati Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Immagine utente certificati Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nome server SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Commento del certificato Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Tipo di dati Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "immagine/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "immagine/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "testo/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Sequenza certificato Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL certificato Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identificatore oggetto di directory Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definizioni LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Patente";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Numero reparto";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Numero impiegato";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tipo di dipendente";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Persona organizzativa Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Criptatura per porte Server";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "CZAG Verisign";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "InBox Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Estensione VPN Verisign sconosciuta";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Estensione VPN Verisign sconosciuta";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identificatore policy Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Avviso CPS v1 Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "CPS v1 NSI Verisign";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "CA SGC Verisign";

/* SET */

"06 03 67 2A 00"	= "Tipo di contenuto";
"06 04 67 2A 00 00"	= "Dati PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "Solo PAN";

"06 03 67 2A 01"	= "Estensione messaggio";
"06 03 67 2A 02"	= "Campo";
"06 04 67 2A 02 00"	= "Nome completo";
"06 04 67 2A 02 01"	= "Nome";
"06 04 67 2A 02 02"	= "Cognome";
"06 04 67 2A 02 03"	= "Cognome alla nascita";
"06 04 67 2A 02 04"	= "Nome luogo";
"06 04 67 2A 02 05"	= "Numero di identificazione";
"06 04 67 2A 02 06"	= "Mese";
"06 04 67 2A 02 07"	= "Data";
"06 04 67 2A 02 08"	= "Indirizzo";
"06 04 67 2A 02 09"	= "Telefono";
"06 04 67 2A 02 0A"	= "Ammontare";
"06 04 67 2A 02 0B"	= "Numero account";
"06 04 67 2A 02 0C"	= "Frase chiave";

"06 03 67 2A 03"		= "Attributo";
"06 04 67 2A 03 00"		= "Certificato";
"06 05 67 2A 03 00 00"	= "Thumbprint chiave root";
"06 05 67 2A 03 00 01"	= "Policy aggiuntiva";

"06 03 67 2A 04"	= "Algoritmo";
"06 03 67 2A 05"	= "Policy";
"06 04 67 2A 05 00"	= "Radice";
"06 03 67 2A 06"	= "Modulo";
"06 03 67 2A 07"	= "Estensione certificato";
"06 04 67 2A 07 00"	= "Chiave root sottoposta a hashing";
"06 04 67 2A 07 01"	= "Tipo di certificato";
"06 04 67 2A 07 02"	= "Dati Merchant";
"06 04 67 2A 07 03"	= "Richiesta carta di credito";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "Estensioni SET";
"06 04 67 2A 07 06"	= "Qualificatore SET";

"06 03 67 2A 08"	= "Marca";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Fornitore";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nazionale";
"06 05 67 2A 0A E2 00"	= "Giappone";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Chiave root sottoposta a hashing";
"06 04 86 8D 6F 03"	= "Tipo di certificato";
"06 04 86 8D 6F 04"	= "Dati Merchant";
"06 04 86 8D 6F 05"	= "Richiesto certificato carta";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "Qualificatore SET";
"06 04 86 8D 6F 63"	= "Dati SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Protezione dati Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identificatore policy di fiducia Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Policy iSign di Apple";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Policy di base X.509 di Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Policy SSL di Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Policy di Apple sulla generazione di certificati locali";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Policy di Apple sulla generazione di CSR locali";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Policy di Apple sulla revoca di CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Policy di Apple sulla revoca di OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Policy S/MIME di Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Policy di Apple sull’autenticazione estensibile";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Policy di Apple sulla firma di Aggiornamento Software";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Policy IPsec di Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Policy iChat di Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Policy di Apple sulla firma delle risorse";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Policy di Apple sul client Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Policy di Apple sul server Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Policy di Apple sulla firma di codice";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Policy di Apple sulla firma dei pacchetti";

"06 08 2A 86 48 86 F7 63 64 02" = "Identificatore algoritmo di sicurezza Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE con firma MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE con firma SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Criptatura FEED Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "FEED Apple (Sperimentale)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE con firma ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identificatore certificato .Mac di Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Richiesta certificato .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Richiesta certificato identità .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Richiesta certificato firma e-mail .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Richiesta certificato criptazione e-mail .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Richiesta elenco archivio .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Richiesta memorizzazione archivio .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Richiesta recupero archivio .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Richiesta rimozione archivio .Mac di Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Estensione certificato .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identità .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Firma e-mail .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Criptazione e-mail .Mac di Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valore richiesta certificato .Mac di Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nome utente";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Password";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nome host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Ripristina contrassegno";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Contrassegno asincrono";

"06 08 2A 86 48 86 F7 63 64 04" = "Utilizzo chiave estesa Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Firma di codice Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Firma codice Apple (sviluppo)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Firma Aggiornamento Software Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Firma codice Apple (riservato)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Firma delle risorse Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Firma iChat di Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Criptatura iChat di Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identità del sistema di Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple Certificate Policies";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Policy di certificazione Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Policy di certificazione .Mac di Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Firma codice";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Sicurezza CDSA Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formati sicurezza CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Estensioni certificato X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Estensioni certificato privato X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitmap firma soggetto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Immagine soggetto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Indirizzo e-mail soggetto";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Esenzioni dall'uso";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritmi sicurezza CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 con ECDSA";

/* end */
